<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ include file="common/header.jsp"%>

			<h1>张氏记传至洛富始祖源流考</h1>
			<p>
			得姓受氏之祖名挥，乃黄帝第五子，造弓赐姓为张，传至周仲公五十八世，以孝友见称于世人，
			传至汉留候良公八十世矣，由良公起一世传至唐九龄公，名子寿号曲江，为唐名宰相，凡二
			十七世，九龄公弟九皋生子九，九章生子九，九宾生子五。九龄公单传至元孙廷杰，公生五子，
			分五大派，长涉宏涧派，次渥宏深派，三沦宏泽派，四沼宏渊派，五洪宏海派，五大派者皆祖
			曲江，洛富为长派宏涧派，第五子载公之后生仁仲，仲生郁，郁生我，城南始祖宋秘书丞遵彧
			公也，公由韶州徙居南康苦竹里，复徙虔之城西，公辞朝回虔，寇警乃占籍邑之城。南宋末元
			初，孙淑荣公诰赠中宪大夫，始立基洛富而成族焉。
			</p>
			
			<p>晋堂祖识</p>
			
<%@ include file="common/foot.jsp"%>